Revit 2027 API
BuiltInFailures.SketchFailures.StairNotEnoughRiserCurves Property
 Boundaries (chains of one or more Boundary Lines) must be connected by at least two Riser Lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairNotEnoughRiserCurves { get; }
Public Shared ReadOnly Property StairNotEnoughRiserCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairNotEnoughRiserCurves {
	FailureDefinitionId^ get ();
}
static member StairNotEnoughRiserCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace